12/data/attachments/df0399f7f3617e8f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_natural_Friend_90695_3</nif:username>
            <nif:friendToBeRequested>soap_friends_30227e46-c1fd-41dc-9412-4d1f0c3bbc5f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>